In [6]:
import pandas as pd

s = pd.Series([1,2,3], index = ["sid","sam","san"])
s

sid    1
sam    2
san    3
dtype: int64

In [7]:
data = {
    "name" : ['sid','san','san'],
    "age" : [21,10,7]
}

p = pd.DataFrame(data)
p

  name  age
0  sid   21
1  san   10
2  san    7

In [15]:
p1 = pd.DataFrame(data, index=[1,2,3])

In [16]:
p1

Empty DataFrame
Columns: [Name, Age]
Index: []

In [10]:
p3 = p1
p3

  name  age
1  sid   21
2  san   10
3  san    7

In [11]:
p4 = p
p4

  name  age
0  sid   21
1  san   10
2  san    7